In [1]:
import pandas as pd
import numpy as np

In [3]:
pd.read_csv('personas.csv')

   Nombre  Edad    Ciudad
0     Ana  28.0      Lima
1    Luis  35.0     Cusco
2  Carlos   NaN  Arequipa
3   María  22.0      Lima
4   Jorge  40.0  Trujillo

ORGANIZACION DE DATOS: UNIR, COMBINAR Y REMODELAR DATAFRAMES
MULTINDEXACION

In [12]:
#indexacion jerarquica
#dtaframe ejes 0=filas, 1=columnas
data=pd.Series(np.random.uniform(size=9),index=[["a","a","a","b","b","c","c","c","c"],[1,2,3,2,1,3,1,2,1]])
data

a  1    0.526373
   2    0.160391
   3    0.488742
b  2    0.703248
   1    0.441434
c  3    0.937043
   1    0.206493
   2    0.214931
   1    0.822066
dtype: float64

In [14]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 2),
            ('b', 1),
            ('c', 3),
            ('c', 1),
            ('c', 2),
            ('c', 1)],
           )

In [15]:
data['b']

2    0.703248
1    0.441434
dtype: float64

In [32]:
df=pd.DataFrame(np.arange(15).reshape(5,3),index=[["a","a","a","b","b"],["# calles","# casas",
                              "# personas","ingresos","egresos"]],columns=[["Lima","Lima","Ica"],
                                     ["Distr 1","Distr 2","Distr"] ])
df

                Lima           Ica
             Distr 1 Distr 2 Distr
a # calles         0       1     2
  # casas          3       4     5
  # personas       6       7     8
b ingresos         9      10    11
  egresos         12      13    14

In [33]:
df.index.names=["prop","subprop"]
df.columns.names=["ciudad","district"]
df

ciudad             Lima           Ica
district        Distr 1 Distr 2 Distr
prop subprop
a    # calles         0       1     2
     # casas          3       4     5
     # personas       6       7     8
b    ingresos         9      10    11
     egresos         12      13    14

In [34]:
df['Lima']

district         Distr 1  Distr 2
prop subprop
a    # calles          0        1
     # casas           3        4
     # personas        6        7
b    ingresos          9       10
     egresos          12       13

ORDENAR NIVELES

In [29]:
#swaplevel#
#df.swaplevel("prop","subprop")

In [36]:
#ESTADISTICA RESUMIDA
#Groupby
df.groupby(level="district",axis="columns").sum()

C:\Users\Anthony\AppData\Local\Temp\ipykernel_23296\1504051662.py:3: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  df.groupby(level="district",axis="columns").sum()

district         Distr  Distr 1  Distr 2
prop subprop
a    # calles        2        0        1
     # casas         5        3        4
     # personas      8        6        7
b    ingresos       11        9       10
     egresos        14       12       13

In [40]:
#Indexacion con columnas
#DATAFRAME> 7 valores de filas y 4 atributos [A,B,C,D]
df2=pd.DataFrame({
        'a':range(7),
        'b':range(7,0,-1),
        'c':['one','one','two','one','two','two','one'],
        'd':[0,1,2,0,1,3,2]
})
#set_index:
df2.set_index(["c","d"])

       a  b
c   d
one 0  0  7
    1  1  6
two 2  2  5
one 0  3  4
two 1  4  3
    3  5  2
one 2  6  1

Combinar dataframe

In [ ]:
#merge, concat, combine

VISUALIZACION DATOS EN PLOT